app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Hei test message!"], ["user_id", 1], ["created_at", "2021-01-07 09:32:32.315369"], ["updated_at", "2021-01-07 09:32:32.315369"]]
---
  def create
    message = current_user.messages.build(message_params)
    if message.save